server/test/load-buy.yaml
config:
    target: 'http://31.156.147.189:5000'
    http:
        timeout: 60
    phases:
        - duration: 10
          arrivalRate: 5
          name: 'Warm up'
        - duration: 10
          arrivalRate: 5
          rumpTo: 10
          name: 'Ramp up'
        - duration: 20
          arrivalRate: 15
          name: 'Sustained load'
    payload:
        - path: 'user.csv'
          fields:
              - 'user'
        - path: 'products.csv'
          fields:
              - 'cid'
              - 'owner'
              - 'price'
              - 'name'
    processor: './processor.cjs'
    plugins:
        expect: {}
scenarios:
    - name: 'test-buy-product'
      flow:
          - log: '[0x{{user}}] request to buy {{ cid }}'
          - post:
                url: '/process-product'
                json:
                    user: '0x{{ user }}'
                    owner: '0x{{ owner }}'
                    cid: '{{ cid }}'
                capture:
                    - json: '$.requestId'
                      as: 'id'
                afterRequest: printStatus
                expect:
                    - statusCode: 201
          - think: 5
          - post:
                beforeRequest: purchaseProduct
                url: '/buy-product'
                json:
                    id: '{{ id }}'
                    user: '0x{{ user }}'
                    cid: '{{ cid }}'
                    owner: '0x{{ owner }}'
                ifTrue: 'status'
                expect:
                    - statusCode: 201
          - log: '[0x{{ user }}] Added cid {{ cid }} to db'