server/test/load-sell.yaml
config:
    target: 'http://192.168.1.56:5000'
    http:
        timeout: 120
    phases:
        - duration: 30
          arrivalRate: 60
          # name: 'Warm up'
        # - duration: 20
        #   arrivalRate: 20
        #   rumpTo: 40
        #   name: 'Ramp up'
        # - duration: 40
        #   arrivalRate: 50
        #   name: 'Sustained load'
    payload:
        path: 'users.csv'
        fields:
            - 'user'
    processor: './processor.cjs'
    plugins:
        expect: {}
scenarios:
    - name: 'test-sell-product'
      flow:
          - log: '[0x{{user}}] request to sell product'
          - post:
                beforeRequest: generateProduct
                url: '/sell-product'
                json:
                    user: '0x{{user}}'
                    product: '{{ product }}'
                capture:
                    - json: '$.cid'
                      as: 'cid'
                    - json: '$.requestId'
                      as: 'id'
                expect:
                    - statusCode: 201
          - log: '[0x{{ user }}] created cid: {{ cid }}'
          - think: 5
          - post:
                beforeRequest: createProduct
                url: '/add-product'
                json:
                    requestId: '{{ id }}'
                    user: '0x{{ user }}'
                    name: '{{ name }}'
                    cid: '{{ cid }}'
                    price: '{{ price }}'
                expect:
                    - statusCode: 201
          - log: '[0x{{ user }}] added {{ cid }} to db'