server/test/load-sell.yaml
config:
    target: 'http://31.156.147.189:5000'
    http:
        timeout: 60
    phases:
        - duration: 10
          arrivalRate: 5
          name: 'Warm up'
        - duration: 30
          arrivalRate: 5
          rumpTo: 10
          name: 'Ramp up'
        - duration: 20
          arrivalRate: 10
          name: 'Sustained load'
    payload:
        path: 'user.csv'
        fields:
            - 'user'
    processor: './processor.cjs'
    plugins:
        expect: {}
scenarios:
    - name: 'test-sell-product'
      flow:
          - log: '[0x{{user}}] request to sell product'
          - post:
                beforeRequest: generateProduct
                url: '/sell-product'
                json:
                    user: '0x{{user}}'
                    product: '{{ product }}'
                    id: '{{id}}'
                capture:
                    - json: '$.cid'
                      as: 'cid'
                expect:
                    - statusCode: 201
          - log: '[0x{{ user }}] created cid: {{ cid }}'
          - think: 5
          - post:
                beforeRequest: contractBuy
                url: '/add-product'
                json:
                    id: '{{id}}'
                    user: '0x{{ user }}'
                    name: '{{ name }}'
                    cid: '{{ cid }}'
                    price: '{{ price }}'
                expect:
                    - statusCode: 201
          - log: '[0x{{ user }}] Added cid {{ cid }} to db'