server/test/load-sell.yaml
config:
    target: 'http://192.168.1.56:5000'
    http:
        timeout: 180
    phases:
        - duration: 10
          arrivalRate: 10
          name: 'Warm up'
        - duration: 10
          arrivalRate: 10
          rumpTo: 20
          name: 'Ramp up'
        - duration: 30
          arrivalRate: 25
          name: 'Sustained load'
    payload:
        path: 'user.csv'
        fields:
            - 'user'
    processor: './processor.cjs'
    plugins:
        expect: {}
scenarios:
    - name: 'test-sell-product'
      flow:
          - log: '[0x{{user}}] request to sell product'
          - post:
                beforeRequest: generateProduct
                url: '/sell-product'
                json:
                    user: '0x{{user}}'
                    product: '{{ product }}'
                capture:
                    - json: '$.cid'
                      as: 'cid'
                    - json: '$.requestId'
                      as: 'id'
                expect:
                    - statusCode: 201
          - log: '[0x{{ user }}] created cid: {{ cid }}'
          - think: 5
          - post:
                beforeRequest: createProduct
                url: '/add-product'
                json:
                    id: '{{id}}'
                    user: '0x{{ user }}'
                    name: '{{ name }}'
                    cid: '{{ cid }}'
                    price: '{{ price }}'
                expect:
                    - statusCode: 201
          - log: '[0x{{ user }}] Added cid {{ cid }} to db'