server/test/load-test.yaml
config:
    target: 'http://localhost:5000'
    http:
        timeout: 30
    phases:
        - duration: 10
          arrivalRate: 5
          name: 'Warm up'
        - duration: 30
          arrivalRate: 5
          rumpTo: 10
          name: 'Ramp up'
        - duration: 20
          arrivalRate: 10
          name: 'Sustained load'
    payload:
        path: 'user.csv'
        fields:
            - 'user'
    processor: './processor.cjs'
scenarios:
    - name: 'test-add-product'
      flow:
          - log: 'Request from 0x{{user}}'
          - post:
                url: '/sell-product'
                beforeRequest: generateProduct
                json:
                    user: '0x{{user}}'
                    product: '{{ product }}'
                capture:
                    - json: '$.cid'
                      as: 'cid'
          - log: '[0x{{ user }}] created cid: {{ cid }}'
          - think: 5
          - post:
                url: '/add-product'
                json:
                    user: '0x{{ user }}'
                    name: '{{ name }}'
                    cid: '{{ cid }}'
                    price: '{{ price }}'
          - log: '[0x{{ user }}] Added cid {{ cid }} to db'