server/test/load-test.yaml
config:
    target: 'http://localhost:5000'
    phases:
        - duration: 5
          arrivalRate: 1
          name: 'Warm up'
        # - duration: 60
        #   arrivalRate: 5
        #   rumpTo: 10
        #   name: 'Ramp up'
        # - duration: 40
        #   arrivalRate: 10
        #   name: 'Sustained load'
    payload:
        path: 'user.csv'
        fields:
            - 'user'
scenarios:
    - name: 'Test'
      flow:
          - log: 'Request from 0x{{user}}'
          - post:
                url: '/my-products'
                json:
                    user: '0x{{user}}'
                capture:
                    - json: '$.products.length'
                      as: 'res'
          - log: 'User 0x{{user}} has {{res}} product/s'